tutorials/heatTransfer/heatSimpleFoam/ImpJet-NWF/0/epsilon
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 class volScalarField;
 format ascii;
 object epsilon;
 version 2.0;
}

dimensions [ 0 2 -3 0 0 0 0 ];

internalField uniform 2.43;

boundaryField
{
  Ambient
  {
    type zeroGradient;
  }
  Entrainment
  {
    type zeroGradient;
  }
  ImpingedWall
  {
    type epsilonLowReWallFunction;
    value uniform 0.000243;
  }
  oldInternalFaces
  {
    type zeroGradient;
  }
  Inlet
  {
    type cyclic;
  }
  Outlet
  {
    type cyclic;
  }
  ExtPipeWall
  {
    type fixedValue;
    value uniform 1e-12;
  }
  Wedge1
  {
    type wedge;
  }
  Wedge2
  {
    type wedge;
  }
  Symm
  {
    type symmetryPlane;
  }
  mappedInlet
  {
    type mapped;
    setAverage no;
    average 2.43;
    value uniform 2.43;
    interpolationScheme cell;
  }
}

