tutorials/heatTransfer/heatSimpleFoam/ImpJet-NWF/0/nut
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 class volScalarField;
 format ascii;
 object nut;
 version 2.0;
}

dimensions [ 0 2 -1 0 0 0 0 ];

internalField uniform 0.037037037037;

boundaryField
{
  Ambient
  {
    type zeroGradient;
  }
  Entrainment
  {
    type zeroGradient;
  }
  ImpingedWall
  {
    type calculated;
  }
  oldInternalFaces
  {
    type zeroGradient;
  }
  Inlet
  {
    type cyclic;
  }
  Outlet
  {
    type cyclic;
  }
  ExtPipeWall
  {
    type calculated;
  }
  Wedge1
  {
    type wedge;
  }
  Wedge2
  {
    type wedge;
  }
  Symm
  {
    type symmetryPlane;
  }
  mappedInlet
  {
    type zeroGradient;
  }
}

